In [25]:
import pandas as pd
import os
import sqlite3

file = 'Sample.xlsx'
df1 = pd.read_excel(file)
sql_db = sqlite3.connect('Closed_college.db')
df1.to_sql('College', sql_db, if_exists = 'replace')



def run_query(query):
    df = pd.read_sql_query(query, sql_db)
    return df

In [26]:
query = 'SELECT * FROM College LIMIT 25'
run_query(query)

,index,Name,OPEID,Location,Geographic_Location,Student_Number,Area
0,0,John Wesley University,293500.0,"High Point,North Carolina",Northeast,6000,3000.0
1,1,Southern Catholic College,4128500.0,"Dawsonville, Georgia",South,2500,6000.0
2,2,Vennard College,NaN,"University Park, Iowa",Midwest,1000,NaN
3,3,Mid-Continent University,2576200.0,"Mayfield, Kentucky",South,3000,7000.0
4,4,Baltimore Hebrew University,NaN,"Baltimore, Maryland",None,1500,NaN
5,5,College of Visual Arts,746200.0,"Saint Paul, Minnesota",Midwest,3500,8700.0
6,6,Pillsbury Baptist Bible College,2284500.0,"Owatonna, Minnesota",None,2600,7982.0
7,7,Chester College of New England,473300.0,"Chester, New Hampshire",Northeast,1700,NaN
8,8,Lambuth University,349800.0,"Jackson, Tennessee",South,1900,5822.0
9,9,Coleman University,729600.0,"San Diego, California",Far West,2500,NaN

In [40]:
df1.count()

Name                   5
OPEID                  5
Location               5
Geographic_Location    5
Student_Number         5
Area                   5
dtype: int64

In [27]:
df1.isnull().sum()

#Sum of null rows per each column

Name                   0
OPEID                  2
Location               0
Geographic_Location    2
Student_Number         0
Area                   4
dtype: int64

In [28]:
df1['OPEID'] = df1['OPEID'].fillna('0')

#filling null values for column 'Religious Affilation' with 'No religion'

In [29]:
print (df1['OPEID'])

0        293500
1    4.1285e+06
2             0
3    2.5762e+06
4             0
5        746200
6    2.2845e+06
7        473300
8        349800
9        729600
Name: OPEID, dtype: object

In [30]:
df1['Geographic_Location']

0    Northeast
1        South
2      Midwest
3        South
4          NaN
5      Midwest
6          NaN
7    Northeast
8        South
9     Far West
Name: Geographic_Location, dtype: object

In [39]:
Unknown_Geo_Location = df1.dropna(inplace=True)
df1.isnull().sum()

Name                   0
OPEID                  0
Location               0
Geographic_Location    0
Student_Number         0
Area                   0
dtype: int64

In [42]:
df1

,Name,OPEID,Location,Geographic_Location,Student_Number,Area
0,John Wesley University,293500,"High Point,North Carolina",Northeast,6000,3000.0
1,Southern Catholic College,4.1285e+06,"Dawsonville, Georgia",South,2500,6000.0
3,Mid-Continent University,2.5762e+06,"Mayfield, Kentucky",South,3000,7000.0
5,College of Visual Arts,746200,"Saint Paul, Minnesota",Midwest,3500,8700.0
8,Lambuth University,349800,"Jackson, Tennessee",South,1900,5822.0

In [43]:
df1.isnull().sum()

Name                   0
OPEID                  0
Location               0
Geographic_Location    0
Student_Number         0
Area                   0
dtype: int64

In [35]:
query_Geo_Location = """
select 
 Geographic_Location
,sum(Student_Number) as "Total Student"
,avg(Student_Number) as "Avg Student"
,count(*) as "Number of Colleges"
from College
group by Geographic_Location; """

run_query(query_Geo_Location)

  Geographic_Location  Total Student  Avg Student  Number of Colleges
0                None           4100  2050.000000                   2
1            Far West           2500  2500.000000                   1
2             Midwest           4500  2250.000000                   2
3           Northeast           7700  3850.000000                   2
4               South           7400  2466.666667                   3

In [37]:
query_college_per_location = """
select 
Geographic_Location
,count(*) as "Colleges per Geo Location"
from College
group by Geographic_LOcation
order by "Colleges per Geo Location" asc;
"""

run_query(query_college_per_location)

  Geographic_Location  Colleges per Geo Location
0            Far West                          1
1                None                          2
2             Midwest                          2
3           Northeast                          2
4               South                          3